CSI API ETABS v1
cStory.GetGUID Method
 Retrieves the GUID of a defined story
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGUID(
	string Name,
	ref string GUID
)
Function GetGUID (
	Name As String,
	ByRef GUID As String
) As Integer
Dim instance As cStory
Dim Name As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetGUID(Name, GUID)
int GetGUID(
	String^ Name,
	String^% GUID
)
abstract GetGUID :
        Name : string *
        GUID : string byref -> int
Parameters
Name
Type: System.String
 The name of a defined story
GUID
Type: System.String
 The GUID of the story
Return Value
Type: Int32
 Returns zero if the value is successfully retrieved, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim iGUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get story GUID
       ret = SapModel.Story.GetGUID("Story2", iGUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace